In [2]:
#installing packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import statsmodels.datasets as dt
import statsmodels.api as sm

C:\Users\JAINMOD\AppData\Local\Continuum\Anaconda3\lib\site-packages\statsmodels\compat\pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

In [7]:
#data structure
s = pd.Series([1,2,3,np.NaN,7,9])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    7.0
5    9.0
dtype: float64

In [8]:
dates = pd.date_range('20170701',periods=5)
dates

DatetimeIndex(['2017-07-01', '2017-07-02', '2017-07-03', '2017-07-04',
               '2017-07-05'],
              dtype='datetime64[ns]', freq='D')

In [13]:
dates_yr = pd.date_range('20160701',periods=365)
dates_yr

DatetimeIndex(['2016-07-01', '2016-07-02', '2016-07-03', '2016-07-04',
               '2016-07-05', '2016-07-06', '2016-07-07', '2016-07-08',
               '2016-07-09', '2016-07-10',
               ...
               '2017-06-21', '2017-06-22', '2017-06-23', '2017-06-24',
               '2017-06-25', '2017-06-26', '2017-06-27', '2017-06-28',
               '2017-06-29', '2017-06-30'],
              dtype='datetime64[ns]', length=365, freq='D')

In [14]:
df = pd.DataFrame(np.random.randn(8,5))
df

          0         1         2         3         4
0 -0.433805 -0.187656 -1.239148  0.129993  1.724032
1  0.891531 -0.740183 -0.545456  1.944209  1.755754
2 -0.581929 -2.540767 -1.199917  1.291139  0.883013
3 -0.337675  0.461037  0.396222 -0.725902  0.565870
4  1.485370 -1.208150  0.387458 -1.020066  0.282033
5 -0.949049 -1.354752 -0.154444 -0.139806  0.011062
6  1.028881  1.489738  0.834191  0.736898 -1.476769
7  0.814978 -0.914115 -0.612621 -0.231436 -0.443782

In [25]:
# Creating Data frame by using index and colum names
df1 = pd.DataFrame(np.random.randn(5,5), index =dates, columns =list('ABCDE'))
df1
df2 = pd.DataFrame(np.random.randn(5,5), index = ['Blue','Orange','Pink','Red','Purple'], columns =list('ABCDE'))
df2

               A         B         C         D         E
Blue    1.673869 -1.076699 -0.342301  1.089404 -1.181439
Orange -0.179008 -0.671745  0.814706 -0.183115  0.513824
Pink   -0.292531 -0.447572  1.853795 -0.356048  1.653990
Red     1.110733  0.037961  0.657223 -0.288193  1.663536
Purple  1.057415  1.216676  0.674963  1.256585  0.711182

In [23]:
# Strings
string = 'Hello'
if 'H' and 'f' in string :
    print('It is available')
else :
    print('Not there')

Not there

In [28]:
s1 = pd.Series(np.random.randn(5),name = "Testing")
s1

0   -0.308096
1    1.205306
2    0.123758
3    1.877729
4   -1.179636
Name: Testing, dtype: float64

In [31]:
#importing Boston data for Analysis
input_raw = dt.get_rdataset("Boston", "MASS").data
input_raw.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [35]:
#Importing HR Analytcs dataset
pay_equity = pd.read_csv('C:/Users/JAINMOD/Desktop/Respiratory/Python Learning/data.csv')
pay_equity.head()

   Emp_ID Division  Site Family  Band  Gender         DOJ          Comp
0       1   PHARMA  CADO  Sales     4    Male  10/24/2016   92679.36127
1       2   PHARMA  CADO  Sales     3    Male    9/9/2002  149186.59570
2       3   PHARMA  CADO  Sales     4    Male   10/9/2007  145547.56730
3       4   PHARMA  CADO  Sales     6  Female    1/6/1997  113265.97200
4       5   PHARMA  CADO  Sales     4    Male    3/5/2001  142829.44750

In [42]:
#Creating a conditional column
pay_equity['Male'] = np.where(pay_equity['Gender'] == "Male",1,0)
pay_equity.head()
pay_equity_new = pay_equity.copy()
pay_equity_new=pay_equity_new.drop(['Gender'], axis =1)
pay_equity_new.head()

   Emp_ID Division  Site Family  Band         DOJ          Comp  Male
0       1   PHARMA  CADO  Sales     4  10/24/2016   92679.36127     1
1       2   PHARMA  CADO  Sales     3    9/9/2002  149186.59570     1
2       3   PHARMA  CADO  Sales     4   10/9/2007  145547.56730     1
3       4   PHARMA  CADO  Sales     6    1/6/1997  113265.97200     0
4       5   PHARMA  CADO  Sales     4    3/5/2001  142829.44750     1

In [51]:
# dropping rows
pay_equity_new=pay_equity_new.drop(pay_equity_new.index[3:8])
pay_equity_new.head()

    Emp_ID Division  Site Family  Band         DOJ          Comp  Male
0        1   PHARMA  CADO  Sales     4  10/24/2016   92679.36127     1
3        4   PHARMA  CADO  Sales     6    1/6/1997  113265.97200     0
4        5   PHARMA  CADO  Sales     4    3/5/2001  142829.44750     1
10      11   PHARMA  CADO  Sales     4   2/17/1997  138643.79640     1
11      12   SANDOZ  CABV  Sales     4   4/28/1997  122071.14480     1

In [ ]:
#creating a calculated column
pay_equity_new['Tenure'] = pay_equity